Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination Properties
The AnalysisLoadCombination type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
GroupIDs
 Gets or sets the identifiers of the groups of the analysis load combination.
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Name
 Gets or sets the name of the analysis load combination.
PartialSafetyFactors
 Gets or sets the partial safety factors of the analysis load combination.
ReductionFactors
 Gets or sets the reduction factors of the analysis load combination.
ScalingFactors
 Gets or sets the scaling factors of the analysis load combination.
Type
 Gets or sets the combination type of the analysis load combination.
Top
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace